print("введите радиус круга в см")#вывод
a=float(input())#вводим любое числовое начение
b=a/100#в метрах
pi=3.14#пи
c=2*pi*a#длина окружности
s=pi*a*a#площадь окружности
v=2*pi*b#длина окружности в метрах
n=pi*b*b#площадь окружности в метрах
print("длина в см:",c,"площадь в см:",s,"длина в м:",v,"площадь в м:",n)#вывод
g=a*2**0.5#длина стороны квадрата в см
gg=a*2**0.5/100#длина стороны квадрата в м
d=2*a*3**0.5#длина стороны треугольника в см
dd=2*a*3**0.5/100#длина стороны треугольника в м
print("длина стороны квадрата в см:",g,"длина стороны треуг в см:",d,"длина квадрата в м:",gg,"длина стороны треуг в м:",dd)#вывод
q=2*a#длина стороны квадрата в см
qq=2*a/100#длина стороны треуг в см
w=a*3**0.5#длина стороны восьмиугольника в см
ww=a*3**0.5/100#длина стороны квадрата в м
y=a*(2-2**0.5)**0.5#длина стороны треуг в м
yy=a*(2-2**0.5)**0.5/100#длина стороны восьмиугольника в м
print("длина стороны квадрата в см:",q,"длина стороны треуг в см:",w,"длина стороны восьмиугольника в см:",y,"длина квадрата в м:",qq,"длина стороны треуг в м:",ww,"длина стороны восьмиугольника в м:",yy)#вывод